app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."title" ASC
---
  def index

      @categories = Category.all.order(:title)