app/controllers/restaurants_controller.rb

  def search
    @restaurants = Restaurant.search(
      name_or_description_cont: params[:q]
    ).result
---
SELECT restaurants.*, (69.09332411348201 * ABS(restaurants.latitude - 36.7608719) * 0.7071067811865475) + (59.836573914187355 * ABS(restaurants.longitude - -76.523173848702) * 0.7071067811865475) AS distance, CASE WHEN (restaurants.latitude >= 36.7608719 AND restaurants.longitude >= -76.523173848702) THEN  45.0 WHEN (restaurants.latitude <  36.7608719 AND restaurants.longitude >= -76.523173848702) THEN 135.0 WHEN (restaurants.latitude <  36.7608719 AND restaurants.longitude <  -76.523173848702) THEN 225.0 WHEN (restaurants.latitude >= 36.7608719 AND restaurants.longitude <  -76.523173848702) THEN 315.0 END AS bearing FROM "restaurants" WHERE (restaurants.latitude BETWEEN 36.4714083337783 AND 37.050335466221696 AND restaurants.longitude BETWEEN -76.88448831327327 AND -76.16185938413074) ORDER BY distance ASC

  def set_restaurant
    @restaurant = Restaurant.find_by(id: params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]